tap "cantino/mcfly"

if OS.linux?
   tap "gromgit/fuse"
end

if OS.mac?
    cask "alacritty", args: { appdir: "~/Applications" }
    cask "beyond-compare", args: { appdir: "~/Applications" }
    cask "caffeine", args: { appdir: "~/Applications" }
    cask "firefox"
    cask "font-fira-code"
    cask "font-fira-code-nerd-font"
    cask "font-fira-mono-nerd-font"
    cask "font-hack-nerd-font"
    cask "ghostty"
    cask "google-chrome"
    cask "inkscape", args: { appdir: "~/Applications" }
    brew "reattach-to-user-namespace"
    cask "iterm2", args: { appdir: "~/Applications" }
    cask "karabiner-elements"
    cask "qlmarkdown", args: { appdir: "~/Applications" }
    cask "rectangle", args: { appdir: "~/Applications" }
    # cask "steam", args: { appdir: "~/Applications" }
    cask 'vagrant', args: { appdir: "~/Applications" }
    cask "visual-studio-code", args: { appdir: "~/Applications" }
    cask "vlc", args: { appdir: "~/Applications" }
    cask "windows-app"
end
brew "automake"
brew "bat"
brew "coreutils"
brew "ctags"
brew "fd"
brew "x264"
brew "xvid"
brew "ffmpeg"
brew "findutils"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "git-extras"
brew "git-filter-repo"
brew "git-lfs"
brew "gnu-getopt", link: true
brew "gnu-sed"
brew "highlight"
brew "jq"
brew "jsonlint"
brew "julia"
brew 'lame'
brew "luarocks"
brew "lynx"
brew "mcfly"
brew "tree-sitter"
brew "neovim"
brew "openssl"
brew "packer"
brew "podofo"
brew "prettier"
brew "python-yq"
brew "ranger"
brew "rename"
brew "readline"
brew "ripgrep"
brew "rubyfmt"
brew "rustup"
brew "shellcheck"
brew "spaceman-diff"
brew "stylua"
brew "tidy-html5"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "x264"
brew "xvid"
brew "youtube-dl"
brew "zsh"
brew "zsh-vi-mode"
