tap 'cantino/mcfly'

if OS.mac?
    tap 'homebrew/cask'
end

tap 'homebrew/cask-fonts'
tap 'homebrew/bundle'
tap 'homebrew/core'

if OS.linux?
   tap 'gromgit/fuse'
end

cask 'firefox'
cask 'font-fira-code'
cask 'font-hack-nerd-font'
cask 'font-fira-nerd-font'
cask 'font-fira-code-nerd-font'
cask 'font-fira-mono-nerd-font'
cask 'google-chrome'
cask 'inkscape'

if OS.mac?
    cask 'firefox'
    cask 'font-fira-code'
    cask 'google-chrome'
    cask 'inkscape'
    cask 'iterm2'
    cask 'karabiner-elements'
    cask 'steam'
    cask 'osxfuse'
    brew 'reattach-to-user-namespace'
    brew 'ntfs-3g'
    cask 'qlmarkdown'
    cask 'vlc'
end

brew 'automake'
brew 'bat'
brew 'coreutils'
brew 'ctags'
brew 'fasd'
brew 'findutils'
brew 'fzf'
brew 'gh'
brew 'git'
brew 'git-delta'
brew 'git-extras'
brew 'highlight'
brew 'lame'
brew 'mcfly'
brew 'neovim'
brew 'openssl'
brew 'podofo'
brew 'python3'
brew 'ranger'
brew 'readline'
brew 'ripgrep'
brew 'spaceman-diff'
brew 'tidy-html5'
brew 'tmux'
brew 'tree'
brew 'x264'
brew 'xvid'
brew 'youtube-dl'
brew 'zsh'
brew 'ffmpeg'
brew 'rename'
